{
  "locale": "en",
  "theme": "dark",
  "header": {
    "logo": "Carlos Bueno",
    "navLinks": [
      { "id": "home", "label": { "en": "Home", "es": "Inicio" } },
      { "id": "about", "label": { "en": "About", "es": "Acerca de" } },
      { "id": "education", "label": { "en": "Education", "es": "Educación" } },
      { "id": "experience", "label": { "en": "Experience", "es": "Experiencia" } },
      { "id": "projects", "label": { "en": "Projects", "es": "Proyectos" } },
      { "id": "publications", "label": { "en": "Publications", "es": "Publicaciones" } },
      { "id": "awards", "label": { "en": "Awards", "es": "Premios" } },
      { "id": "mentoring", "label": { "en": "Mentoring", "es": "Mentoría" } },
      { "id": "skills", "label": { "en": "Skills", "es": "Habilidades" } },
      { "id": "contact", "label": { "en": "Contact", "es": "Contacto" } }
    ]
  },
  "sections": {
    "home": {
      "title": {
        "en": "Carlos Bueno",
        "es": "Carlos Bueno"
      },
      "subtitle": {
        "en": "Scientific Software Developer and Computational Biophysicist",
        "es": "Desarrollador de Software Cientifico y Biofísico Computacional"
      }
    },
    "about": {
      "title": {
        "en": "About",
        "es": "Acerca"
      },
      "content": {
        "en": "As a Postdoctoral Associate at the Rice Center for Theoretical Biological Physics (CTBP) and a Molecular Sciences Software Institute (MolSSI) Fellow, I develop physics-based molecular models to investigate biological phenomena. I am a lead developer of several open-source force fields, including OpenAWSEM for protein dynamics, Open3SPN2 for DNA, and OpenActin for actin cytoskeletal networks. These models, written in Python and built on top of the OpenMM molecular dynamics framework, are designed following best practices in scientific software development with modular architecture, continuous integration workflows, and documentation accessible to beginners, advanced users, and developers alike. My current research focuses on optimizing force field parameters using machine learning, in direct collaboration with experimental laboratories to ensure that each model addresses well-defined questions in structural and cellular biology. I also actively support the training of the next generation of scientists through initiatives such as Science Clubs Peru, iGEM, and Frontiers in Science, where I guide students in interdisciplinary projects focused on biophysical model development. My goal is to create open-source, modular, reproducible, and sustainable computational tools that not only accelerate scientific discovery but also help build the infrastructure needed by the scientific community.",
        "es": "Como investigador postdoctoral en el Centro de Física Biológica Teórica de la Universidad de Rice (CTBP) y fellow del Instituto de software de ciencias moleculares (MolSSI), desarrollo modelos moleculares basados en principios físicos para investigar fenómenos biológicos. Soy un desarrollador principal de varios campos de fuerza open-source, como OpenAWSEM para dinámica de proteínas, Open3SPN2 para ADN y OpenActin para redes del citoesqueleto celular de actina. Estos modelos, escritos en Python, utilizan como base la librería de dinamicas moleculares de OpenMM y están diseñados siguiendo buenas prácticas de ingeniería de software, con arquitectura modular, integración continua y documentación accesible para todo tipo de usuarios. Actualmente trabajo en la optimización de parámetros de estos modelos mediante técnicas de inteligencia artificial en colaboración directa con laboratorios experimentales para garantizar que cada herramienta esté alineada con preguntas concretas en biología estructural y celular. También participo activamente en la formación de nuevas generaciones de científicos a través de iniciativas como Science Clubs, iGEM y Frontiers in Science, guiando a estudiantes en proyectos interdisciplinarios enfocados en el desarrollo de modelos biofísicos. Mi objetivo es crear herramientas computacionales modulares, reproducibles,  sostenibles y de codifo abierto que no solo aceleren el descubrimiento científico, sino que también creen la infraestructura que la comunidad científica necesita."
      }
    },
    "education": {
      "title": { "en": "Education", "es": "Educación" },
      "entries": [
        {
          "degree": { "en": "PhD, Systems, Synthetic and Physical Biology", "es": "Doctorado en Sistemas, Biología Sintética y Física" },
          "institution": "Rice University, Houston, TX",
          "date": "Dec 2022",
          "details": {
            "en": "Dissertation: Mesoscale Models for the Study of Emergent Behaviors Arising from Protein Interactions",
            "es": "Disertación: Modelos de mesoescala para el estudio de comportamientos emergentes de interacciones de proteinas"
          }
        },
        {
          "degree": { "en": "BSc. Chemistry. BSc. Pharmacy and Biochemistry", "es": "Bachiller en Ciencia con mencion en Química. Bachiller en Ciencia con mencion en Farmacia y Bioquímica" },
          "institution": "Cayetano Heredia University, Lima, Peru",
          "date": "May 2013",
          "details": {
            "en": "",
            "es": ""
          }
        }
      ]
    },
    "experience": {
      "title": {
        "en": "Experience",
        "es": "Experiencia"
      },
      "entries": [
        {
          "institution": "Molecular Sciences Software Institute (MolSSI), Remote",
          "logo": "images/logos/molssi_logo.jpeg",
          "tags": ["#SoftwareEngineering", "#BestPractices", "#OpenSource"],
          "roles": [
            {
              "title": { "en": "Software Fellow", "es": "Fellow de Software" },
              "dates": { "en": "Jul. 2024 - Present", "es": "Jul. 2024 - Presente" },
              "highlights": {
                "en": "Contributed to modular and reproducible scientific software in molecular sciences as a MolSSI Software Fellow.",
                "es": "Contribuí a software científico modular y reproducible en ciencias moleculares como Fellow de MolSSI."
              },
              "responsibilities": {
                "en": [
                  "Participated in the Software Best Practices Boot Camp at MolSSI HQ.",
                  "Developed infrastructure tools for computational molecular sciences.",
                  "Collaborated with Software Scientists in specialized training on maintainable and extensible code design."
                ],
                "es": [
                  "Participé en el Boot Camp de Mejores Prácticas de Software en la sede de MolSSI.",
                  "Desarrollé herramientas de infraestructura para ciencias moleculares computacionales.",
                  "Colaboré con científicos de software en capacitación especializada sobre diseño de código mantenible y extensible."
                ]
              }
            }
          ]
        },
        {
          "institution": "Center for Theoretical Biological Physics, Rice University, Houston, TX",
          "logo": "images/logos/riceuniversity_logo.jpeg",
          "tags": ["#Biophysics", "#Python", "#Mentorship"],
          "roles": [
            {
              "title": { "en": "Postdoctoral Scientist", "es": "Científico Postdoctoral" },
              "dates": { "en": "Jan. 2023 - Present", "es": "Ene. 2023 - Presente" },
              "highlights": {
                "en": "Lead developer of Python-based tools for protein analysis; mentoring students and presenting work internationally.",
                "es": "Desarrollador principal de herramientas en Python para análisis de proteínas; mentoría y presentaciones internacionales."
              },
              "responsibilities": {
                "en": [
                  "Developed Python packages for structure and sequence analysis using Pandas, NumPy, Scipy, PyTorch, Numba, Simpy.",
                  "Authored 3 peer-reviewed publications and presented research in 2 international conferences.",
                  "Mentored undergraduate and graduate students across interdisciplinary teams."
                ],
                "es": [
                  "Desarrollé paquetes de Python para el análisis de estructuras y secuencias utilizando Pandas, NumPy, Scipy, PyTorch, Numba, Simpy.",
                  "Autor de 3 publicaciones científicas y presentaciones en 2 conferencias internacionales.",
                  "Mentoría a estudiantes de pregrado y posgrado en equipos interdisciplinarios."
                ]
              }
            },
            {
              "title": { "en": "Research Assistant", "es": "Asistente de Investigación" },
              "dates": { "en": "Jan. 2016 - Dec. 2022", "es": "Ene. 2016 - Dic. 2022" },
              "highlights": {
                "en": "Created coarse-grained models and simulation tools; contributed to 10 publications and 6 international talks.",
                "es": "Modelado de proteínas y simulaciones; contribución en 10 publicaciones y 6 conferencias internacionales."
              },
              "responsibilities": {
                "en": [
                  "Developed Python packages to model and analyze protein interactions.",
                  "Led a team of 4 developers on C++ scientific software.",
                  "Applied statistical modeling and machine learning to simulations.",
                  "Built a mathematical model of protein network connectivity.",
                  "Authored 10 publications, presented in 6 conferences, and delivered internal research updates."
                ],
                "es": [
                  "Desarrollé paquetes en Python para modelado y análisis de interacciones proteicas.",
                  "Lideré un equipo de 4 personas en software científico en C++.",
                  "Apliqué modelado estadístico y aprendizaje automático en simulaciones.",
                  "Desarrollé un modelo matemático de conectividad en redes de proteínas.",
                  "Autor de 10 publicaciones, presentaciones en 6 conferencias y actualizaciones internas."
                ]
              }
            }
          ]
        },
        {
          "institution": "Bioinformatics Unit, FARVET, Ica, Peru",
          "logo": "images/farvet_logo.png",
          "tags": ["#VaccineDevelopment", "#Bioinformatics", "#Industry"],
          "roles": [
            {
              "title": { "en": "Bioinformatics Scientist", "es": "Científico en Bioinformática" },
              "dates": { "en": "Mar. 2013 - Dec. 2014", "es": "Mar. 2013 - Dic. 2014" },
              "highlights": {
                "en": "Built software pipelines for vaccine design and delivered technical updates to corporate leadership.",
                "es": "Diseñé pipelines de software para vacunas y presenté avances técnicos a líderes corporativos."
              },
              "responsibilities": {
                "en": [
                  "Created software tools for vaccine development using public bioinformatics databases.",
                  "Contributed to veterinary vaccine development projects.",
                  "Presented progress reports to executives and interdisciplinary departments."
                ],
                "es": [
                  "Creé herramientas de software para el desarrollo de vacunas usando bases de datos bioinformáticas.",
                  "Contribuí a proyectos de vacunas veterinarias.",
                  "Presenté reportes de progreso a ejecutivos y áreas interdisciplinarias."
                ]
              }
            }
          ]
        },
        {
          "institution": "Bioinformatics Lab, Cayetano Heredia University, Lima, Peru",
          "logo": "images/upch_logo.jpeg",
          "tags": ["#Bioinformatics", "#Teaching", "#Infrastructure"],
          "roles": [
            {
              "title": { "en": "Research Assistant", "es": "Asistente de Investigación" },
              "dates": { "en": "Jan. 2012 - Jul. 2015", "es": "Ene. 2012 - Jul. 2015" },
              "highlights": {
                "en": "Developed bioinformatics tools and taught computational science in undergraduate and workshop settings.",
                "es": "Desarrollé herramientas bioinformáticas y enseñé ciencia computacional en cursos y talleres."
              },
              "responsibilities": {
                "en": [
                  "Built and used bioinformatics software for scientific research.",
                  "Curated and analyzed large-scale biological datasets with Python.",
                  "Managed GPU cluster server deployment and networking.",
                  "Taught classes and workshops on simulation, visualization, and scientific programming."
                ],
                "es": [
                  "Desarrollé y utilicé software bioinformático para investigación científica.",
                  "Curé y analicé conjuntos de datos biológicos con Python.",
                  "Administré implementación y redes de clústeres de GPU.",
                  "Enseñé cursos y talleres sobre simulación, visualización y programación científica."
                ]
              }
            }
          ]
        }
      ]
    },
    "publications": {
      "title": {
        "en": "Publications",
        "es": "Publicaciones"
      },"entries":[
        {
          "year": 2024,
          "entries": [
            {
              "authors": "Galpern EA, Jaafari H, Bueno C, Wolynes PG, Ferreiro DU",
              "title": "Reassessing the exon–foldon correspondence using frustration analysis",
              "journal": "PNAS",
              "volume": "121",
              "issue": "28",
              "pages": "e2400151121",
              "doi": "https://doi.org/10.1073/pnas.2400151121"
            },
            {
              "authors": "Jaafari H, Bueno C, Schafer NP, Martin J, Morcos F, Wolynes PG",
              "title": "The physical and evolutionary energy landscapes of devolved protein sequences corresponding to pseudogenes",
              "journal": "PNAS",
              "volume": "121",
              "issue": "21",
              "pages": "e2322428121",
              "doi": "https://doi.org/10.1073/pnas.2322428121"
            }
          ]
        },
        {
          "year": 2023,
          "entries": [
            {
              "authors": "Chen X, Jin S, Chen M, Bueno C, Wolynes PG",
              "title": "The marionette mechanism of domain-domain communication in the antagonist, agonist, and coactivator responses of the estrogen receptor",
              "journal": "PNAS",
              "volume": "120",
              "pages": "1–9",
              "doi": "https://doi.org/10.1073/pnas.2216906120"
            }
          ]
        },
        {
          "year": 2022,
          "entries": [
            {
              "authors": "Gu X, Schafer NP, Bueno C, Lu W, Wolynes PG",
              "title": "A structural dynamics model for how CPEB3 binding to SUMO2 can regulate translational control in dendritic spines",
              "journal": "PLoS Comp. Bio.",
              "volume": "18",
              "pages": "e1010657",
              "doi": "https://doi.org/10.1371/journal.pcbi.1010657"
            },
            {
              "authors": "Jin S, Bueno C, Lu W, Wang Q, Chen M, Chen X, Wolynes PG, Gao Y",
              "title": "Computationally exploring the mechanism of bacteriophage T7 gp4 helicase translocating along ssDNA",
              "journal": "PNAS",
              "volume": "119",
              "pages": "1–10",
              "doi": "https://doi.org/10.1073/pnas.2202239119"
            },
            {
              "authors": "Bueno C, Liman J, Schafer NP, Cheung MS, Wolynes PG",
              "title": "A generalized Flory-Stockmayer kinetic theory of connectivity percolation and rigidity percolation of cytoskeletal networks",
              "journal": "PLoS Comp. Bio.",
              "volume": "18",
              "pages": "e1010105",
              "doi": "https://doi.org/10.1371/journal.pcbi.1010105"
            }
          ]
        },
        {
          "year": 2021,
          "entries": [
            {
              "authors": "Lu W, Bueno C, Schafer NP, Moller J, Jin S, Chen X, Chen M, Gu X, Davtyan A, de Pablo JJ, Wolynes PG",
              "title": "OpenAWSEM with Open3SPN2: A fast, flexible, and accessible framework for large-scale coarse-grained biomolecular simulations",
              "journal": "PLoS Comp. Bio.",
              "volume": "17",
              "pages": "1–21",
              "doi": "https://doi.org/10.1371/journal.pcbi.1008308"
            },
            {
              "authors": "Thadani NN, Zhou Q, Gamas KR, Butler S, Bueno C, Schafer NP, Morcos F, Wolynes PG, Suh J",
              "title": "Frustration and Direct-Coupling Analyses to Predict Formation and Function of Adeno-Associated Virus",
              "journal": "Biophys J.",
              "volume": "120",
              "pages": "489–503",
              "doi": "https://doi.org/10.1016/j.bpj.2020.12.018"
            }
          ]
        },
        {
          "year": 2020,
          "entries": [
            {
              "authors": "Liman J, Bueno C, Eliaz Y, Schafer NP, Waxham MN, Wolynes PG, Levine H, Cheung MS",
              "title": "The Role of the Arp2/3 Complex in Shaping the Dynamics and Structures of Branched Actomyosin Networks",
              "journal": "PNAS",
              "volume": "117",
              "pages": "10825–31",
              "doi": "https://doi.org/10.1073/pnas.1922494117"
            },
            {
              "authors": "Shikai J, Contessoto VG, Chen M, Schafer NP, Lu W, Chen X, Bueno C, Hajitaheri A, Sirovetz BJ, Davtyan A, Papoian GA, Tsai MY, Wolynes PG",
              "title": "AWSEM-Suite: A Protein Structure Prediction Server Based on Template-Guided, Coevolutionary-Enhanced Optimized Folding Landscapes",
              "journal": "Nucleic Acids Res.",
              "volume": "48",
              "pages": "W25–W30",
              "doi": "https://doi.org/10.1093/nar/gkaa356"
            }
          ]
        },
        {
          "year": 2019,
          "entries": [
            {
              "authors": "Wang Q, Chen M, Schafer NP, Bueno C, Song SS, Hudmon A, Wolynes PG, Waxham MN, Cheung MS",
              "title": "Assemblies of calcium/calmodulin-dependent kinase II with actin and their dynamic regulation by calmodulin in dendritic spines",
              "journal": "PNAS",
              "volume": "116",
              "pages": "18937–18942",
              "doi": "https://doi.org/10.1073/pnas.1911452116"
            }
          ]
        },
        {
          "year": 2017,
          "entries": [
            {
              "authors": "Potoyan DA, Bueno C, Zheng W, Komives EA, Wolynes PG",
              "title": "Resolving the NFκB hetero-dimer binding paradox: Strain and frustration guide the binding of dimeric transcription factors",
              "journal": "J. Am. Chem. Soc.",
              "volume": "2017",
              "pages": "jacs.7b08741",
              "doi": "https://doi.org/10.1021/jacs.7b08741"
            }
          ]
        },
        {
          "year": 2016,
          "entries": [
            {
              "authors": "Tataje-Lavanda L, Montalván Á, Bueno C, Requena D, Fernández-Díaz M",
              "title": "First evidence of detection of Asia/South America II (A/SAII) infectious bronchitis virus in a commercial broiler flock in Peru",
              "journal": "Veterinary Record Case Reports",
              "volume": "4",
              "issue": "1",
              "pages": "e000292",
              "doi": "https://doi.org/10.1136/vetreccr-2016-000292"
            }
          ]
        },
        {
          "year": 2014,
          "entries": [
            {
              "authors": "Rueda D, Sheen P, Gilman RH, Bueno C, Santos M, Pando-Robles V, Batista CV, Zimic M",
              "title": "Nicotinamidase/pyrazinamidase of Mycobacterium tuberculosis forms homo-dimers stabilized by disulfide bonds",
              "journal": "Tuberculosis (Edinb)",
              "volume": "2014",
              "pages": "Pii: S1472-9792(14)20554-3",
              "doi": "https://doi.org/10.1016/j.tube.2014.08.008"
            }
          ]
        }
      ]
    },
    "projects": {
      "title": {
        "en": "Projects",
        "es": "Proyectos"
      },
      "entries": [
        {
          "year": 2024,
          "entries": [
            {
              "title": "AWESOME",
              "description": "Implementing modular python code for potentials in openMM, analysis tools in Python and machine learning optimization with PyTorch of the AWSEM forcefield by retraining it using high-throughput ΔΔG data."
            },
            {
              "title": "OpenFit",
              "url": "https://github.com/cabb99/OpenFit",
              "description": "Developed a molecular density fitting method that optimizes the correlation between experimental and simulated density maps. Implemented efficient algorithms for computing density maps and calculating derivatives for integration with MD simulations. Optimized code performance using Numba for high-speed parallel computations."
            }
          ]
        },
        {
          "year": 2023,
          "entries": [
            {
              "title": "OpenActin",
              "url": "https://github.com/cabb99/OpenActin",
              "description": "Developed a novel mesoscale open-source coarse-grained force-field to simulate actin network aggregation using openMM."
            },
            {
              "title": "DCA-frustratometer",
              "url": "https://github.com/cabb99/Frustratometer",
              "description": "Co-led the development of a Python package to parameterize energy models from protein sequence data using Direct Coupling Analysis (DCA). The open-source code includes documentation, tutorials, unit testing, and CI with GitHub Actions."
            }
          ]
        },
        {
          "year": 2021,
          "entries": [
            {
              "title": "Percolation of actin networks",
              "description": "Designed a mathematical model of percolation in actin networks based on connectivity and percolation of graphs."
            }
          ]
        },
        {
          "year": 2020,
          "entries": [
            {
              "title": "Open3SPN2",
              "url": "https://github.com/cabb99/open3spn2",
              "description": "Developed an open-source coarse-grained force-fields for DNA simulations in collaboration with Juan J. de Pablo group. Included version-control, documentation, tutorials, parameterized unit testing, continuous integration using github actions, and distribution through pip and anaconda including conda-forge, with force classes using inheritance from openMM forces. Forcefield was adapted from previous C++ versions from the code for LAMMPS and compared them using jupyter notebooks."
            },
            {
              "title": "OpenAWSEM",
              "url": "https://github.com/cabb99/openawsem",
              "description": "Co-developed an open-source coarse-grained force-fields for protein simulations based on previous LAMMPS C++ code. Included version-control, documentation, tutorials, and distribution through pip and anaconda including conda-forge."
            }
          ]
        },
        {
          "year": 2019,
          "entries": [
            {
              "title": "Multivalent linker model in MEDYAN",
              "url": "https://bitbucket.org/jkomianos/medyan/src/CaMKII/",
              "description": "Designed, coded, and implemented a C++ plugin for a mechanochemical model of actin networks. Led a technical team of 2 graduate students and a computer scientist in collaboration with Gareg Papoian."
            }
          ]
        },
        {
          "year": 2018,
          "entries": [
            {
              "title": "Prediction of folding free energy based on sequence",
              "description": "Applied Bayesian inference methods to predict folding free energy changes from sequence data."
            }
          ]
        },
        {
          "year": 2017,
          "entries": [
            {
              "title": "Acute myeloid leukemia outcome predictor",
              "url": "https://github.com/cabb99/IntroCompBio",
              "description": "Explored predictive models in Python to assess AML prognosis, utilizing random forests and evolutionary algorithms."
            }
          ]
        }
      ]
    },
    "awards": {
      "title": {
        "en": "Awards",
        "es": "Premios"
      },
      "entries": [
        {
          "year": 2024,
          "title": { "en": "MolSSI Software Fellow", "es": "MolSSI Fellow en desarrollo de Software" },
          "issuer": { "en": "Molecular Sciences Software Institute (MolSSI)", "es": "Instituto de Software de Ciencias Moleculares (MolSSI)" },
          "description": {
            "en": "12-month fellowship for advanced graduate students and postdocs developing open-source software for computational molecular sciences. Trained in software best practices, and mentored by MolSSI Software Scientists",
            "es": "Beca de 12 meses para estudiantes avanzados de posgrado y postdoctorados que desarrollan software de código abierto para ciencias moleculares computacionales. Capacitado en buenas prácticas de software, y entrenado por científicos de software de MolSSI"
          },
          "link": "https://molssi.org/carlos-bueno-from-excel-automation-to-open-source-innovation/"
        },
        {
          "year": 2021,
          "title": { "en": "Shirley Chan Student Travel Grant", "es": "Beca de Viaje Shirley Chan" },
          "issuer": { "en": "American Physical Society (APS) DBIO", "es": "Sociedad Americana de Física (APS) DBIO" },
          "description": {
            "en": "Awarded the Shirley Chan Student Travel Grant to attend and present at the APS March Meeting 2021. Recognizes high-quality abstracts in sessions sponsored by DBIO",
            "es": "Beca de viaje Shirley Chan para asistir y presentar en la APS March Meeting 2021. Reconoce resúmenes de alta calidad en sesiones patrocinadas por DBIO"
          },
          "link": "https://ctbp.rice.edu/news/featured-stories/ctbp-graduate-students-win-competitive-travel-grants"
        },
        {
          "year": 2016,
          "title": { "en": "Silver Medal – iGEM 2016", "es": "Medalla de Plata – iGEM 2016" },
          "issuer": { "en": "iGEM Foundation", "es": "Fundación iGEM" },
          "description": {
            "en": "Advised Rice University’s iGEM team in computational modeling of the violacein biosynthetic pathwayfor non-invasive gut inflammation and cancer detection via photoacoustic imaging.", 
            "es": "Asesoré al equipo iGEM de Rice University en la modelización computacional de la ruta biosintética de la violaceína sensibles a inflamación para la detección no invasiva de inflamación intestinal y cáncer mediante imagen fotoacústica."
          },
          "link": "https://2016.igem.org/Team:Rice" 
        }
      ]
    },
    "mentoring": {
      "title": {
        "en": "Mentoring",
        "es": "Mentoría"
      },
      "entries": [
        {
          "year": 2023,
          "role": "Mentor",
          "program": "Frontiers in Science program",
          "institution": "Rice University – University of Houston",
          "location": "Houston, TX USA"
        },
        {
          "year": 2021,
          "role": "Instructor",
          "program": "Diseña tu micro-mundo: Construye modelos en computadora para simular proteínas.",
          "organization": "Science-clubs",
          "location": "Perú"
        },
        {
          "year": 2020,
          "role": "Mentor",
          "program": "Frontiers in Science program",
          "institution": "Rice University – University of Houston",
          "location": "Houston, TX USA"
        },
        {
          "year": "2015-2019",
          "role": "Mentor",
          "program": "Serendipity mentorship program"
        },
        {
          "year": 2016,
          "role": "Teaching Assistant",
          "program": "Physical Biology"
        },
        {
          "year": 2016,
          "role": "Advisor",
          "program": "Rice Igem Team",
          "institution": "Rice University",
          "location": "Houston, TX USA"
        },
        {
          "year": 2014,
          "role": "Course Instructor",
          "program": "Introduction to Bioinformatics",
          "department": "Philosophy and Science Department",
          "institution": "UPCH",
          "location": "Lima, Peru"
        },
        {
          "year": 2013,
          "role": "Course Instructor",
          "program": "In-silico design and experimental testing of immunogenic epitopes as vaccine candidates",
          "lab": "Bioinformatics and Molecular Biology Lab",
          "institution": "UPCH",
          "location": "Lima, Peru"
        },
        {
          "year": "2012-2013",
          "role": "Teaching Assistant",
          "program": "Organic Chemistry",
          "department": "Department of Chemistry",
          "institution": "UPCH",
          "location": "Lima, Peru"
        }
      ]
    },
    "skills": {
      "title": {
        "en": "Skills",
        "es": "Habilidades"
      },
      "entries": [
        "Python",
        "Git",
        "Linux (Advanced)",
        "MATLAB",
        "C++ (Intermediate)",
        "Javascript",
        "R",
        "SQL (Basic)"
      ]
    }
  }
}